# SQL Mini Project 

## Country Club Database: Tier 2 Part 1

#### Q1. Some of the facilities charge a fee to members, but some do not. Write a SQL query to produce a list of the names of the facilities that do. 

<code>SELECT * 
FROM Facilities 
WHERE membercost > 0
</code>

#### Q2. How many facilities do not charge a fee to members? 

<code>SELECT COUNT(*) 
FROM Facilities 
WHERE membercost=0
</code>

#### Q3. Write a SQL query to show a list of facilities that charge a fee to members, where the fee is less than 20% of the facility's monthly maintenance cost. Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

<code>SELECT facid, name, membercost, monthlymaintenance
FROM Facilities
WHERE membercost > 0 AND membercost < 0.2 * monthlymaintenance
</code>

#### Q4. Write an SQL query to retrieve the details of facilities with ID 1 and 5. Try writing the query without using the OR operator.

<code>SELECT *
FROM Facilities
WHERE facid IN (1,5)
</code>

##### Q5. Produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than \$100. Return the name and monthly maintenance of the facilities in question. 

<code>SELECT name, monthlymaintenance,
        CASE WHEN monthlymaintenance > 100 THEN 'expensive'
        ELSE 'cheap' END AS facility_type
FROM `Facilities` 
</code>

##### Q6. You'd like to get the first and last name of the last member(s) who signed up. Try not to use the LIMIT clause for your solution.

<code>SELECT firstname, surname
FROM Members
WHERE joindate = (SELECT MAX(joindate) FROM Members) 
</code>

#### Q7. Produce a list of all members who have used a tennis court. Include in your output the name of the court, and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name

<code>SELECT DISTINCT fac.name, CONCAT(mem.firstname,' ',mem.surname) as member_name FROM Bookings 
INNER JOIN Facilities as fac USING (facid)
INNER JOIN Members as mem USING (memid)
WHERE facid < 2 AND memid != 0
ORDER BY member_name
</code>

#### Q8: Produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than \$30. Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries. 

<code>SELECT fac.name, CONCAT(mem.firstname, ' ', mem.surname) AS member_name,
	CASE WHEN memid = 0 THEN fac.guestcost * slots
	ELSE fac.membercost * slots END AS cost
FROM `Bookings`
INNER JOIN `Facilities` AS fac USING (facid)
INNER JOIN `Members` AS mem USING (memid)
WHERE CAST(starttime AS DATE) = '2012-09-14' AND 30 < (
      CASE WHEN memid = 0 THEN fac.guestcost * slots
           ELSE fac.membercost * slots END)
ORDER BY cost DESC
</code>

#### Q9: This time, produce the same result as in Q8, but using a subquery. 


<code>SELECT name, member_name, cost
FROM (SELECT fac.name as name, 
      CONCAT(mem.firstname, ' ', mem.surname) AS member_name,
      CASE WHEN memid = 0 THEN fac.guestcost * slots
		ELSE fac.membercost * slots END AS cost
	  FROM `Bookings`
	  INNER JOIN `Facilities` AS fac USING (facid)
      INNER JOIN `Members` AS mem USING (memid)
      WHERE CAST(starttime AS DATE) = '2012-09-14') AS subquery
WHERE cost > 30
ORDER BY cost DESC
</code>